app/controllers/application_controller.rb

    def set_past_conferences
      past_conferences = Conference.all(:limit => 3, :order => 'year DESC')
---
SELECT * FROM `conferences` LIMIT 1