app/controllers/community_controller.rb

  def browse_all
     @title = "Neurodag Members"
     order = params[:order]
     logger.debug("ORDER #{order}")
     @users = User.paginate :all, :page => params[:page], :order => 'created_at DESC', :per_page => 10
---
SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT * FROM `users` ORDER BY created_at DESC LIMIT 0, 10