app/controllers/posters_controller.rb

    def index
      #@posters = Poster.find(:all)
      @posters = Poster.paginate :page => params[:page], :per_page => 10, :order => 'id ASC'
---
SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT * FROM `posters` ORDER BY id ASC LIMIT 0, 10
SELECT count(*) AS count_all FROM `posters` WHERE (`posters`.conference_id = 1)

    def your
      @posters = Poster.find_all_by_user_id(current_user.id)
---
SELECT * FROM `posters` WHERE (`posters`.`user_id` = 16)