app/controllers/registrations_controller.rb

SELECT * FROM `registrations` WHERE (`registrations`.`id` = 1)
---
  def show
    @user = current_user
    @attend = "No"
    @attend = "Yes" if attend_active_conference?
    @registration = Registration.find(params[:id])

SELECT `registrations`.id FROM `registrations` WHERE (`registrations`.`user_id` = 5 AND `registrations`.conference_id = 1) LIMIT 1
INSERT INTO `registrations` (`payment_status`, `updated_at`, `bringing_posters`, `type`, `plenary_speaker`, `user_id`, `conference_id`, `participate_competition`, `selected_for_competition`, `created_at`) VALUES(NULL, '2009-09-14 21:14:28', NULL, NULL, NULL, 5, 1, NULL, NULL, '2009-09-14 21:14:28')
SELECT * FROM `conferences` ORDER BY year DESC LIMIT 3
SELECT * FROM `registrations` WHERE (`registrations`.`user_id` = 5 AND `registrations`.`conference_id` = 1) LIMIT 1
---
  def create
    logger.debug("CREATE REG")
    current_user_registration = Registration.find_by_user_id(current_user.id)
    if !current_user_registration
      current_user.conferences << active_conference
      flash[:notice] = "You have been registered."
    else
      flash[:notice] = "You are already registered."
    end
    redirect_to registration_path(current_user.registrations.first.id)

SELECT * FROM `registrations` WHERE (`registrations`.`id` = 1)
UPDATE `registrations` SET `updated_at` = '2009-09-14 20:17:57', `payment_status` = 0 WHERE `id` = 1
SELECT `registrations`.id FROM `registrations` WHERE (`registrations`.`user_id` = 1 AND `registrations`.conference_id = 1 AND `registrations`.id <> 1) LIMIT 1
---
  def update
    @registration = Registration.find(params[:id])
    @registration.update_attributes(params[:registration])
    if @registration.save
      flash[:notice] = @@success_msg
    else
      flash[:notice] = @@error_msg
    end
    redirect_to registration_path(current_user.registrations.first.id)