app/controllers/talks_controller.rb

SELECT * FROM `pages` WHERE (`pages`.conference_id = 3)
SELECT * FROM `talks` ORDER BY created_at DESC LIMIT 0, 30
---
    def index
      @talks = Talk.paginate :all, :page => params[:page], :order => 'created_at DESC'

SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT * FROM `talks` ORDER BY created_at DESC LIMIT 0, 5
SELECT count(*) AS count_all FROM `talks`
---
    def referee
      #@talks_paginated = Talk.paginate :all, :page => params[:page], :order => 'created_at DESC'
      @talks = Talk.paginate :page => params[:page], :per_page => 5, :order => 'created_at DESC'

SELECT * FROM `pages` WHERE (`pages`.conference_id = 1)
SELECT * FROM `talks` ORDER BY created_at DESC LIMIT 0, 30
---
    def all_ref_rated
      @talks = Talk.paginate :all, :page => params[:page], :order => 'created_at DESC'

SELECT * FROM `talks` WHERE (`talks`.`id` = 1)
SELECT * FROM `rates` WHERE (`rates`.`user_id` = 5) AND (`rates`.rateable_id = 1 AND `rates`.rateable_type = 'Talk' AND (`rates`.`dimension` = 'organization')) LIMIT 1
SELECT sum(`rates`.stars) AS sum_stars FROM `rates` WHERE (`rates`.rateable_id = 1 AND `rates`.rateable_type = 'Talk' AND (`rates`.`dimension` = 'organization'))
---
    def rate
      @talk = Talk.find(params[:id])
      dimension = params[:dimension]

      @talk.rate(params[:stars], current_user, dimension)

      id = "ajaxful-rating-#{!dimension.blank? ? "#{dimension}-" : ""}talk-#{@talk.id}"