app/controllers/users_controller.rb

  def referee_rated_talks
    page = params[:page]
    @users = User.paginate :all, :page => page, :per_page => 1, :order => 'created_at DESC', :conditions => "users.role = 'referee' "
---
SELECT * FROM `pages` WHERE (`pages`.conference_id = 2)
SELECT * FROM `users` WHERE (users.role = 'referee' ) ORDER BY created_at DESC LIMIT 0, 1
SELECT count(*) AS count_all FROM `users` WHERE (users.role = 'referee' )

  def index
    @title = "Neurodag User Hub"
    @user = User.find(session[:user_id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def register
    @title = "Register"
    if param_posted?(:user)
      @user = User.new(params[:user])
      empty_spec = Spec.new
      @user.spec = empty_spec
      @user.save_with_captcha
---
INSERT INTO `users` (`updated_at`, `authorization_token`, `role`, `screen_name`, `first_name`, `password`, `last_name`, `email`, `created_at`) VALUES('2009-09-14 21:14:22', NULL, NULL, 'referee2', 'sdfsd', '1234', 'SDFSDF', 'sdfgfds@sdf.com', '2009-09-14 21:14:22')

  def login
    @title = "Log in to #{@@site_name}"
    if request.get?
      @user = User.new(:remember_me => remember_me_string)
    elsif param_posted?(:user)
      @user = User.new(params[:user])
      user = User.find_by_screen_name_and_password(@user.screen_name,
                                                   @user.password)
---
SELECT * FROM `users` WHERE (`users`.`screen_name` = 'rune' AND `users`.`password` = 'admin') LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `role` = 'referee', `updated_at` = '2009-09-14 21:19:29' WHERE `id` = 5