app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 5)
---
  def show_rated_talks
    @user = User.find(params[:id])